//==============================================================
// Закрепление метода sort()
//==============================================================



//============================================================
// Сортировка без параметра-функции
//============================================================
/**сравнеие идёт преобразованных в строки значений, по прапвилам
 * сравнения строк. Порядок берётся из Unicode.
 */


console.log([1, 2, 3, 4].sort());// [1, 2, 3, 4]

console.log([1, 2, 10, 21].sort());// [1, 10, 2, 21]

console.log(['a', 'bb', 'ccc', 'dddd'].sort());// ['a', 'bb', 'ccc', 'dddd']

console.log(['арбузы', 'бананы', 'Вишня'].sort());// ['Вишня', 'арбузы', 'бананы']

console.log(['слово', 'Слово', '1 Слово', '2 Слова'].sort());// ['1 Слово', '2 Слова', 'Слово', 'слово']

console.log(['A', 'a', 'b', 'c'].sort()); //['A', 'a', 'b', 'c']
console.log(['ава', 'Ава'].sort()); //['Ава', 'ава']

//============================================================
// Сортировка c параметром-функцией
//============================================================
// [2, 1, 5, 4, 3]
           //a  b
console.log([2, 1, 5, 4, 3].sort((a, b) => a-b)); // [1, 2, 3, 4, 5]
console.log([2, 1, 5, 4, 3].sort((a, b) => b-a)); // [5, 4, 3, 2, 1]

let arrObjSort = [{key: 0, value: 1}, {key:  1, value: 2}, {key:  1, value: 2}, {key: 2, value: 3}, {key: 2, value: 3}, {key: 2, value: 3}, {key: 3, value: 1}, {key: 4, value: 1}];

console.log(arrObjSort.sort((a,b) => {
return  a.value - b.value || a.key - b.key;
}));


